---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderThirdLegTooShortOrRunWidthTooGreatFailure
source: html/dbf1a4d8-cfef-42ba-17fc-bbd31ebe6b35.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderThirdLegTooShortOrRunWidthTooGreatFailure Property

The third leg of winder run is too short or the runwidth is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderThirdLegTooShortOrRunWidthTooGreatFailure { get; }
```